In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame( {
    'user': [1, 2, 3],
    'age': [24, 54, 17],
    'sex': ['F', 'F', 'M'],
    'occupation': ['technician', 'musician', 'student']
})

In [4]:
df['sex'] = df['sex'].map({'F':'Female', 'M':'Male'})

In [5]:
df

   user  age     sex  occupation
0     1   24  Female  technician
1     2   54  Female    musician
2     3   17    Male     student